{"title":"Eloquent Chapter 2","message":"A fragment of code that produces a value is called an expression.\n\nSince an expression is a fragement; a statement is a full sentence.  Statements are followed by a semicolon.\n\nwhen a statement that changes a value (or performs an action is called a side affect.\n\nBindings\n-Bindings are variables that hold information; \n\n-Bindings are defined and assigned by an operator and given an expression (expression is something that has to be evaluated).\n\n-A name defined in a binding can be used as an expression (in the place of a number or calulation)\n\n-Bindings do not contain values, they grasp them; refering to values so they can be remembered or referenced later.\n\n-two bindings can refer to the same value.\n\nbindings include: let var (variable) const(constant)\n\n- let can define multiple bindings. definitions must be separated by comas.\n\n- words that have meaning in JS can not be used in bindings.\n\n-The collection of bindings and their values that exist at a given time is called an environment.\n\n\nFunctions\n-A function is a piece of program wrapped in a value.\n\n-Executing a function is called invoking, calling or applying it by using the name of the function with parentheses after the expression(name of the function).\n\n-Values giving to functions are called arguments; when defining or binding a function the arguments are put in curly brackets. \n\n-console.log is also a function\n\nReturn values\n\n-When a function produces a value it is a return value; anything that produces a value is an expression (values to be evaluated)\n\nControl Flow\n\n-statements are read from top to bottom and left to right.\n\n-conditional execution is created with the if keyword\n\nif is a form of control flow, an order in which code is to be executed\n\n-multiple statements combined into a one statement using curly brackets is a block.\n\n-loop is another form of control flow\n\nwhile loop keeps entering a statement as long as the value is true when converted to a boolean. when it is no longer true it stops;\n\ndo loop executes its body at least once and will keep looping until the value is changed.\n\nIndenting code \n\n- indenting makes the structur of the code stand out\n\nFor Loop\n\nFor Loop is another form of control flow\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","id":"6a1abccb-0078-4b8f-b52c-0acff3e690f3","date":"2019-01-03T13:03:55.517Z","updated":"2019-01-03T19:07:26.707Z"}